var e={frontmatter:{date:`2026-02-22T15:11:51`,updatedDate:`2026-02-22T15:11:51`,title:`再见 2025`,tags:[`碎碎念`],category:``,toc:!0,incomplete:!1,hidden:!0,thumbnail:``,copyright:`严禁转载`,categories:[]},titleHtml:`再见 2025`,html:`<p>迟了两个月才写这篇文章。总而言之，2025 结束了。</p>
<!-- more -->
<p>本文禁止转载、禁止修改、禁止分发。</p>
<h2 id="随便的时间线"><a href="#随便的时间线">随便的时间线</a></h2>
<p>按时间顺序说说吗。</p>
<h4 id="剪掉的头发"><a href="#剪掉的头发">剪掉的头发</a></h4>
<p>1 月份被母上带着剪了头发。曾经的头发留得很长，已经超越了及腰，马上就要连屁股都要超过了。可惜母上的剪头发手艺似乎很烂。剪完之后，头发变得很短，妹妹头那种感觉。<x-spoiler>虽然并不能算很短吧但还是 gd 发作。</x-spoiler></p>
<p>由于很害怕理发店拖到 10 月份才去修理。</p>
<h4 id="炭火"><a href="#炭火">炭火</a></h4>
<p><img src="/images/Pasted%20image%2020260223000723.png" alt=""></p>
<p>其实是翻找相册看到了回老家的照片。一年前也是在老家，烧着木柴，很多很多烟，熏得眼睛都睁不开了。虽然很不舒服，但玩火还是很有趣。<del>虽然，传说玩火尿床</del></p>
<p>一年的过去，也拍了炭火的照片。简直一模一样。就像时间没有流逝过。</p>
<h4 id="牛丼-️-溫泉蛋"><a href="#牛丼-️-溫泉蛋">牛丼 ⭐️ 溫泉蛋</a></h4>
<p>Feb 27, 看到了牛丼和溫泉蛋的照片。不能確定，也許是那時候第一次喫這個吧。但是後來好像就不再去食其家了。</p>
<p>小時候很討厭喫蛋。現在才發現大概是因爲家裏每次做的蛋都不好吃吧。會燒得很老，喫起來就像喫一坨乾燥的澱粉一樣。</p>
<h4 id="蝸牛"><a href="#蝸牛">蝸牛</a></h4>
<p>March 8，照片裏是薩利亞的蝸牛。很喜歡喫這個。</p>
<h4 id="薄荷"><a href="#薄荷">薄荷</a></h4>
<p><img src="/images/Pasted%20image%2020260223000809.png" alt=""></p>
<p>April 1. 照片裏是薄荷，忘記什麼時候賣的了。高中畢業前在教室裏種了很多薄荷，雖然種子質量太差，發芽率很低。後來送給了老師。拿回自家的那盆換土的時候，媽媽一鏟子下去把根都弄斷了。……于是就死了。</p>
<p>這次也並沒有逃過死掉的宿命。暑假沒法把它帶回去，劇烈的太陽會把它曬死，只好放在窗臺上。……然後，它的死因是被我放在窗台上，被風吹倒了。掉在了幾層樓下。倒是沒有粉身碎骨。只是沒法澆水，一點點枯萎了。</p>
<p>生命如此。</p>
<h4 id="編譯原理"><a href="#編譯原理">編譯原理</a></h4>
<p>被氣哭了。2025 年了還在拿 C 語言寫編譯器。明明有更好的寫法，卻被語言限制，一邊寫一邊哭。</p>
<h4 id="孤獨搖滾"><a href="#孤獨搖滾">孤獨搖滾！</a></h4>
<p><img src="/images/Pasted%20image%2020260223000838.png" alt=""></p>
<p>和朋友去看了。紀念卡。</p>
<h4 id="還是薄荷"><a href="#還是薄荷">還是薄荷</a></h4>
<p><img src="/images/Pasted%20image%2020260223000849.png" alt=""></p>
<p>May 10 的照片。薄荷被我養到開了花。</p>
<p>但是不知道爲什麼後面薄荷就一點點從底部枯萎到頂部。可能它沒掉下去也會死掉吧。</p>
<h4 id="飄起來的裙子"><a href="#飄起來的裙子">飄起來的裙子</a></h4>
<p>風吹起來，把裙子吹得膨脹起來。當時覺得很有趣，拍了照片。</p>
<p>……嗯，不要騎自行車的時候穿裙子。小心卡在車輪裡。</p>
<h4 id="落幕前奏"><a href="#落幕前奏">落幕前奏</a></h4>
<p>拖延症很久以後終於不知道因爲什麼原因去了醫院。已經記不清了。總而言之，很久以前就差點拿到的證明，重新拿到了。</p>
<h4 id="珂朵莉"><a href="#珂朵莉">珂朵莉</a></h4>
<p>June 8. 也是和朋友出去玩，在一家穀子店看到。啊……這樣一個塑料牌賣300,二次元的錢真好賺。</p>
<h4 id="數學分析"><a href="#數學分析">數學分析</a></h4>
<p>爲什麼我還要重修這玩意。</p>
<h4 id="鮮椒炒豬肝"><a href="#鮮椒炒豬肝">鮮椒炒豬肝</a></h4>
<p>從小就不愛喫。但是，不知道爲什麼，突然很想點自己覺得難喫的東西。……然後意外的發現其實挺好喫。唉，大概又是因爲小時候家裏做出來的豬肝太老了。</p>
<h4 id="歡樂谷"><a href="#歡樂谷">歡樂谷</a></h4>
<p>和朋友去歡樂谷玩了。發現自己再也不敢玩過山車和跳樓機…… 是否是一種焦慮症變嚴重的表現呢。</p>
<h4 id="沒有記錄的七月"><a href="#沒有記錄的七月">沒有記錄的七月</a></h4>
<p>七月的照片沒有什麼特別的。</p>
<h4 id="十五"><a href="#十五">十五</a></h4>
<p>弟弟撿到一隻小雞。……天知道爲什麼在城市裏居然還能撿到小雞啊。下着大雨的一天，突然在家裏聽到了鳥叫聲，才知道是弟弟撿了一隻被雨淋溼瑟瑟發抖的小鳥過來。</p>
<p>它被起名叫做十五。本來以爲會死掉。沒想到，幾天後，還是沒死掉。然後是一個月，兩個月。之前還好奇它爲什麼不飛起來，後來才發現原來十五是一隻雞，本來就沒法飛……</p>
<p>後來十五被送去了鄉下，很適合它的地方。長得很肥大一隻，還會下蛋了。</p>
<p>就是長大後的雞遠遠沒有小雞可愛了。</p>
<p>長大後的人也不如小孩可愛吧。</p>
<h4 id="鍵帽"><a href="#鍵帽">鍵帽</a></h4>
<p>朋友家養的貓的名字。</p>
<p>在朋友家睡了一晚，晚上貓突然跳到我身上來，嚇了我一大跳。不要咬我啊！！！</p>
<p>鍵帽似乎很調皮。而且喜歡咬我。回去以後手上都有被抓的痕跡。</p>
<p>不和貓計較。</p>
<h4 id="落幕前奏-ii"><a href="#落幕前奏-ii">落幕前奏 II</a></h4>
<p>那天去了醫院，約上了手術。</p>
<h4 id="鯊鯊"><a href="#鯊鯊">鯊鯊</a></h4>
<p><img src="/images/Pasted%20image%2020260223000949.png" alt=""></p>
<p>九月。 朋友賣了一隻好大的宜家鯊魚玩偶給我。好可愛啊！</p>
<h4 id="新的朋友"><a href="#新的朋友">新的朋友</a></h4>
<p>課上認識的。</p>
<h4 id="小豆泥"><a href="#小豆泥">小豆泥</a></h4>
<p><img src="/images/Pasted%20image%2020260223000936.png" alt=""></p>
<p>一直都很喜歡，突然發現了線下可以買到小豆泥周邊的店。……然後就連續剁手賣了 10 只各種各樣的小豆泥。</p>
<p>好喜歡小豆泥。</p>
<h4 id="jk-店"><a href="#jk-店">JK 店</a></h4>
<p>朋友想去，然後把我帶進坑了。</p>
<h4 id="學術會議"><a href="#學術會議">學術會議</a></h4>
<p>11月，去了。</p>
<h4 id="nixos"><a href="#nixos">NixOS</a></h4>
<p>12 月，開始使用 NixOS。</p>
<h2 id="做了"><a href="#做了">做了</a></h2>
<p>先是弄了一個 vue 的練手作品，Misskey 前端，叫做 Sukerbuka。拿 vuetify 弄的。就是感覺有點醜…… 顏值是第一驅動力。于是就放棄了。</p>
<p>後來，開始學 react。作爲 react 練手的作品，又去寫了一個 Misskey 前端，叫做 papilio.</p>
<p>可惜開發到後面就，性能問題出來了。似乎是 react 的過。開個網站就要吃掉 1GB 的內存，還有一些 CPU 狂轉的問題。</p>
<p>于是就慢慢被放棄了。雖然還是會偶爾更新一下，修一些小 bug。</p>
<h2 id="讀了"><a href="#讀了">讀了</a></h2>
<p>PFPL （Practical Foundations for Programming Languages）。在開始前，對 PL 方向的理解其實非常淺薄。讀了以後才發現有很多很多很多東西沒有接觸過。雖然讀起來非常吃力，但感覺到了收獲，很開心。</p>`,headings:[{depth:2,slug:`随便的时间线`,text:`随便的时间线`},{depth:4,slug:`剪掉的头发`,text:`剪掉的头发`},{depth:4,slug:`炭火`,text:`炭火`},{depth:4,slug:`牛丼-️-溫泉蛋`,text:`牛丼 ⭐️ 溫泉蛋`},{depth:4,slug:`蝸牛`,text:`蝸牛`},{depth:4,slug:`薄荷`,text:`薄荷`},{depth:4,slug:`編譯原理`,text:`編譯原理`},{depth:4,slug:`孤獨搖滾`,text:`孤獨搖滾！`},{depth:4,slug:`還是薄荷`,text:`還是薄荷`},{depth:4,slug:`飄起來的裙子`,text:`飄起來的裙子`},{depth:4,slug:`落幕前奏`,text:`落幕前奏`},{depth:4,slug:`珂朵莉`,text:`珂朵莉`},{depth:4,slug:`數學分析`,text:`數學分析`},{depth:4,slug:`鮮椒炒豬肝`,text:`鮮椒炒豬肝`},{depth:4,slug:`歡樂谷`,text:`歡樂谷`},{depth:4,slug:`沒有記錄的七月`,text:`沒有記錄的七月`},{depth:4,slug:`十五`,text:`十五`},{depth:4,slug:`鍵帽`,text:`鍵帽`},{depth:4,slug:`落幕前奏-ii`,text:`落幕前奏 II`},{depth:4,slug:`鯊鯊`,text:`鯊鯊`},{depth:4,slug:`新的朋友`,text:`新的朋友`},{depth:4,slug:`小豆泥`,text:`小豆泥`},{depth:4,slug:`jk-店`,text:`JK 店`},{depth:4,slug:`學術會議`,text:`學術會議`},{depth:4,slug:`nixos`,text:`NixOS`},{depth:2,slug:`做了`,text:`做了`},{depth:2,slug:`讀了`,text:`讀了`}]};export{e as default};